#include <iostream>
#include <time.h>
using namespace std;

/*
 Циклы, массивы
2. *Написать программу, которая выводит одномерный массив в обратном порядке
*/
int main()
{
  setlocale(LC_ALL, "Rus");
  // иниц-ция генератора псевдосулчайных чисел текущим временем в секундах
  //  делается один раз в аначале программы
  srand( time(0) );

  const int size = 30; // константная переменная для размера массива
  // объявление статического массива
  int mas[size] = { 1,2,3,4,5,6,7, /*0,0,0,*/ }; // частичная иниц-ция массива
  // вывод элементов массива в одну строку
  for(int i = 0; i < size; i++) {
    cout << mas[i] << " ";
  }
  cout << endl;
  // вывод массива наборот
  // цикл обхода массива в обратном порядке
  for(int i = size - 1; i >= 0; i--) {
    cout << mas[i] << " ";
  }
  cout << endl;

  // 2) заполнение массива случ. числами
  for(int i=0; i < size; i++) {
    //mas[i] = rand(); // rand() ==> [0; 32767]
    //mas[i] = rand() % 10 + 1; // [1; 10]

    // [10; 20]
    //mas[i] = rand() % 11 + 10; // [10; 20]
    // rand() % 11 ==> [0; 10] + 10 ==> [10; 20]
    // 0 1 2 3 4 5 6 7 8 9 10

    // [-45; +42] <==> [Min; Max]
    // Формула для задания диапазона генрации случ. чисел
    // rand() % (Max - Min + 1) + Min;
    // mas[i] = rand() % ( 42 - (-45) + 1 ) + (-45);
    mas[i] = rand() % 88 - 45; // [-45; 42]
    cout << mas[i] << " ";
  }
  cout << endl;

  cin.get(); cin.get();
}
