Домашнее задание
По теме: Строки

Рекомендации:
Ввод с клавиатуры с помощью cin>> не позволяет ввести пробелы, поэтому можно вместо пробелов вводить символ подчеркивания '_' или воспользоваться cin.getline().
char Str[250];
cin.getline(Str,250);
cout << Str;

1. *Написать программу, которая заменяет все символы вопросительного знака '?' в строке, введенной пользователем, на символы '1'.

2. *Пользователь вводит строку, посчитать, сколько в ней символов "%".

3. **Пользователь вводит строку символов и искомый символ, посчитать сколько раз он встречается в строке.
Для этого написать функцию, которая подсчитывает сколько раз встречается заданный символ в строке.

4. **Пользователь вводит строку. Определить количество букв, количество цифр и количество остальных символов, присутствующих в строке.
Рекомендации:
Для проверки, что символ является числом, не обязательно сравнивать его со всеми 10-ю цифрами, достаточно сравнить код символа с диапазоном кодов цифр.
Код символа '0' - 48, '1' - 49, '2' - 50, ..., '9' - 57. 


5.***Написать функцию, которая определяет является ли строка палиндромом (т.е. строкой, которую можно читать и слева направо, и
справа налево: «А роза упала на лапу Азора», «Аргентина манит негра», «Я ем змея»).
Рекомендации:
Из строки предварительно нужно удалить пробелы и привести ее к одному регистру.


Обязательно.
Изучить примеры из папки "Примеры" и примеры использования библиотечных функций в папке "Функции работы со строками"

Дополнительно
6. Подсчитать количество слов во введенном предложении.
a) * между словами находится только 1 пробел
b) **пробелы также могут располагаться вначале и в конце предложения.
c) ***пробелы могут располагаться вначале и в конце предложения, и между словами может быть более 1 пробела.


7. ***Поиск слова в строке. Пользователь вводит строку (предложение) и искомое слово.
Написать функцию, которая определит есть ли искомое слово во веденном предложении.
Функция принимает два параметра: строку с предложением и строку с искомым словом.
Функция должна вернуть позицию в строке, где встретилось искомое слово.

