#include <iostream>  // Inptu-Output Stream
using namespace std; // std - Standart library C++
/*
* Составьте словесный алгоритм вычисления
*   площади прямоугольника
*/
int main()
{
  setlocale(LC_ALL, "Rus");
  cout << "Алгоритм для вычисления "
          "площади прямоугольника" << endl;
  cout << "1) Ввести длину прямоугольника" << endl;
  cout << "2) Ввести ширину прямоугольника\n"; // "\n" == endl
  cout << "3) Вычсление площади по формуле: "
          "длина * ширину\n";
  cout << "4) Вывод площади прямоугольника на экран"
       << endl;
  cout << "Конец алгоритма\n" << endl;
  // Программа для вычисления площади
  float Dlina; // переменная для хранения длины прямоугольника
  // cout - Console OUTput
  cout << "Введите длину прямоугольника: ";
  // cin - Console INput
  cin >> Dlina; // ввод значения в переменную Dlina
  // 2)
  float Shirina; // переменная для хранения ширины прямоугольника
  cout << "Введите ширину прямоугольника: ";
  cin >> Shirina; // ввод ширины прямоугольника
                  // в переменную Shirina
  // 3) Вычисление площади прямоугольника по формуле
  float S = Dlina * Shirina;  // S - переменная для хранения площади прямоугольника
  // 4)
  cout << "Площадь прямоугольника = " << S << endl;
  cout << "Конец программы\n";

  cin.get(); cin.get();
}


//int main()
//{
//
//}
