#include <iostream>
#include <time.h>  // time()
using namespace std;

/*
 Циклы, массивы

19. *Напишите программу, которая выполняет поэлементную сумму
двух массивов и результат заносит в третий массив.

17. ***Написать программу, копирующую последовательно элементы
2-х массивов размером 5 элементов каждый в один массив размером
10 элементов.

14. ***Написать программу, копирующую элементы 2-х массивов
размером 5 элементов каждый в один массив размером 10 элементов
следующим образом:
- сначала копируются последовательно все элементы, большие 0,
- затем последовательно все элементы, равные 0,
- а затем последовательно все элементы, меньшие 0.
*/

// #define - директива препроцессора
// Предопределением, макроопределение имени SIZE и закрепления
//  за ним значения 10 (дефайн) - для подстановки при препроцессинге - 1 шаг компиляции
// SIZE - это не переменная!!!
//#define SIZE  10
#define SIZE  20 // warning C4005: SIZE: изменение макроопределения

int main()
{
  setlocale(LC_ALL, "Rus");
  srand(time(0));
  /*
  19. *Напишите программу, которая выполняет поэлементную сумму
  двух массивов и результат заносит в третий массив.
  A[5]: { 1, 2, 3, 4,  5 }
  B[5]: { 6, 7, 8, 9, 10 }
  C[5]: {                }
  */
  //const int size = 10; // размер массива - константная переменная
  //int A[size], B[size], C[size]; // C[i] = A[i] + B[i];
  int A[SIZE], B[SIZE], C[SIZE]; // C[i] = A[i] + B[i];
  //int A[10], B[10], C[10]; // C[i] = A[i] + B[i];

  cout << "N) A[" << SIZE << "]\tB[" << SIZE << "]\n"; // шапка таблицы массивов

  for(int i = 0; i < SIZE; i++) {
    // A[] = [1; 10]
    A[i] = rand() % 10 + 1;  // cin >> A[i];
    // B = [20; 30] ==> rand() % (30 - 20 + 1) + 20;
    B[i] = rand() % 11 + 20; // cin >> B[i];
    // два массива столбиком
    cout << i << ") " << A[i] << "\t" << B[i] << endl;
  }
  // суммирование
  for(int i = 0; i < SIZE; i++) {
    C[i] = A[i] + B[i]; // поэлементная сумма двух массивов
  }
  // вывод результирующего массива
  cout << endl; // для отступа
  for(int i = 0; i < SIZE; i++) {
    cout << C[i] << " ";
  }
  cout << endl;


  cin.get(); cin.get();
}
