#include <iostream>
using namespace std;

/*
Задачи урока "11-12. Оператор множественного выбора"

20. *Написать программу, которая определяет, каким днем (Рабочий день,
    Суббота, Воскресенье) является введенный номер дня недели.

13. **Написать программу-калькулятор.
    Пользователь вводит два числа и выбирает арифметическое действие.
    Вывести на экран результат.
Ввод:  10 + 5 <ENTER>
Вывод: 10 + 5 = 15


16. **Необходимо написать программу, которая принимает от пользователя номер
    месяца и сообщает время года, к которому этот месяц относится.
15. **Написать программу, которая по выбору пользователя возводит введенное
    им число в степень от нулевой до седьмой включительно.

5. *Пользователь вводит число.
Определить, положительное это число,
отрицательное или равно нулю.

14. ***Написать программу, которая по выбору пользователя меняет цвет
    консольного приложения. Пользователь может выбрать цвет шрифта и цвет фона.
*/

/*
5. *Пользователь вводит число.
    Определить, положительное это число,
    отрицательное или равно нулю.
*/
int main()
{
  setlocale(LC_ALL, "Rus");
  cout << "Введите число: ";
  double a;
  cin >> a;
  int signA; // переменная для знака числа
             // == 1 , если (a < 0)
             // == 2 , если (a > 0)
             // == 3 , если (a == 0)
  // 1 шаг - кодирование
  // кодирование свойства переменной a
  //  для связи, соотношения к группе
  if (a < 0) { signA = 1; } // 1 - число отриц.
  else if (a > 0) { signA = 2; } // 2 - число полож.
  else /*a == 0*/ { signA = 3; } // 3 - число нулевое

  // 2 - шаг, расшифровка кода из signA
  switch (signA) {
  case 1:
    cout << "Число отрицательное" << endl;
    break; // выход из case, switch
  case 2:
    cout << "Число положительное" << endl;
    break;
  case 3:
    cout << "Число нулевое" << endl;
    break;
  }
  cin.get(); cin.get();
}
