#include <iostream>
#include <iomanip>
#include <time.h>
using namespace std;
// указатели
/*
37. ** Написать функцию, которая принимает указатель
на массив и количество элементов.
Пользуясь ДВУМЯ указателями на массив целых чисел,
функция должна поменять порядок элементов передаваемого
ей массива на обратный.
38. *Написать программу, которая осуществляет поиск
введенного пользователем числа, используя ДВА
указателя на массив целых чисел. Первый указатель
двигается с начала массива, второй - с конца.
39. *Написать программу, которая вычисляет сумму
элементов массива, используя ДВА указателя на массив
целых чисел. Первый указатель двигается с начала
массива, второй - с конца.
*/
void Swap(int* mas, int size) {
  int* p1, * p2;
  p1 = &mas[0];     //p1 = mas;
  p2 = &mas[size - 1];  //p2 = mas + size - 1;
  while (p1 < p2) {
    swap(*p1++, *p2--);
    /*swap(*p1, *p2);
    p1++;
    p2--;
     */
  }
}
int main()
{
  system("chcp 1251 > nul");
  srand(time(0));
  int size;
  cout << "Введите размер массива:";
  cin >> size;
  int* pm = new int[size];
  for (int i = 0; i < size; i++) {
    pm[i] = rand() % 9 + 1;
    cout << *(pm + i) << " ";
  }
  Swap(pm, size);
  cout << endl;

  for (int i = 0; i < size; i++) {
    cout << *(pm + i) << " ";
  }
  cout << endl;
  cin.get(); cin.get();
}
