#include <iostream>
#include <iomanip>
#include <time.h>
using namespace std;

/*
2. *Написать программу, которая заменяет все символы точки "."
в строке, введенной пользователем, на символы восклицательного знака "!".

3. *Написать программу, которая заменяет все символы
вопросительного знака "?" в строке, введенной пользователем,
на символы "1".

4. *Пользователь вводит строку, посчитать, сколько в ней символов "%".

Написать ф-ции:
1) Вычисления длины строки;
2) функцию копирования строк - копирование одной строки в другую;
2) функцию конкатенации (сцепления) двух строк;

5. *Пользователь вводит строку символов и искомый символ,
посчитать сколько раз он встречается в строке.

6. Подсчитать количество слов во введенном предложении.
a) * между словами находится только 1 пробел
b) **пробелы также могут располагаться вначале и в конце предложения.
c) ***пробелы могут располагаться вначале и в конце предложения,
и между словами может быть более 1 пробела.

7.**Пользователь вводит строку и слово. Осуществить
в этой строке поиск заданного слова.
*/

int main()
{
  setlocale(LC_ALL, "Rus");
  srand(time(0));
  // строка - это массив символов типа char: char str[10]
  // Вывод литеральной строки "Hello world!" - константная строка
  cout << "Hello world!" << endl;
  //char str[12 + 1] = { "Hello world!" }; // "Hello world!"+char(0)
  char str[12+1] = "Hello world!"; // "Hello world!"+char(0)
  cout << str << endl; // печать строки str => "Hello world!"

  // иниц-ция строково массив str1 строкой "Hello"
  char str1[5+1] = "HellO"; // + '\0' - терминирующий нуль-символ
  // иниц-ция строково массив str2 списком символолов 
  //char str2[] = { 'H', 'e', 'l', 'l', 'o',  };
  //char str2[5] = { 'H', 'e', 'l', 'l', 'o',  };
  char str2[6] = { 'H', 'e', 'l', 'l', 'o', '\0' };
  cout << "str1: " << str1 << endl;
  cout << "str2: " << str2 << endl;

  cin.get(); cin.get();
}
