#include <iostream>
#include <iomanip>
#include <time.h>
using namespace std;

/*
2. *Написать программу, которая заменяет все символы точки "."
в строке, введенной пользователем, на символы восклицательного
знака "!".

3. *Написать программу, которая заменяет все символы
вопросительного знака "?" в строке, введенной пользователем,
на символы "1".

4. *Пользователь вводит строку, посчитать, сколько в ней символов "%".

Написать ф-ции:
1) Вычисления длины строки;
2) функцию копирования строк - копирование одной строки в другую;
2) функцию конкатенации (сцепления) двух строк;

5. *Пользователь вводит строку символов и искомый символ,
посчитать сколько раз он встречается в строке.

6. Подсчитать количество слов во введенном предложении.
a) * между словами находится только 1 пробел
b) **пробелы также могут располагаться вначале и в конце предложения.
c) ***пробелы могут располагаться вначале и в конце предложения,
и между словами может быть более 1 пробела.

7.**Пользователь вводит строку и слово. Осуществить
в этой строке поиск заданного слова.
*/

int main()
{
  //setlocale(LC_ALL, "Rus");
  // перевод консольного потока ввода-вывода в русскую локаль
  //  с кодовой страницы 866 (Стандартная локаль)
  //  в кодовую страницу 1251 (Русская локаль)
  system( "chcp 1251 > nul" );
  srand(time(0));

  char str1[200]; // строковый буфер на 200 символов для
                  //  чтения строк из консоли

  // 1 чтение одного слова
  cout << "Введите слово: ";
  cin >> str1;
  cin.ignore(); // убрать ENTER после cin >> str1;
  cout << "слово: " << str1 << endl;

  // 2 чтение предложения из нескольких слов
  //  с помощью функции-метода getline() объекта cin
  cout << "Введите предложение: ";
  cin.getline(str1, 200);
  // "\"" - строка из одного символа кавычки: "\"\0" - 2 байта
  // '\"' - одиночный символ кавычки - 1 байт
  cout << "строка: " << "\"" << str1 << '\"' << endl;

  cin.get(); cin.get();
}
