Курс "Язык программирования C"
Тема: Указатели.

Задания для самостоятельной работы.

1) Объвить две переменные и два указателя. Присвоить указателям адреса переменных.
Сложить переменные, используя указатели и присвоить результат третьей переменной.
Вывести результат сложения на экран и адрес результата.

2) Объявить две переменные и два указателя. Присвоить указателям адреса переменных.
Сравнить два указателя. Объяснить результат сравнения.

3) Используя указатели и оператор разыменования, определить наибольшее из двух чисел.

4) Используя указатели и оператор разыменования, определить знак числа, введённого с клавиатуры.

5) Используя указатели и оператор разыменования, обменять местами значения двух переменных.

6) Создать 2 целые переменные и определить "расстояние" между ними в памяти.

7) Используя указатели заполнить массив случайными числами и вывести его на экран. 

8) Написать функцию, которая принимает указатель на массив и количество элементов и возвращает минимальный элемент массива (значение и номер элемента). 

9) Создать массив из 10 целых чисел. Заполнить массив случайным образом.
Пользуясь указателем на массив целых чисел, посчитать сумму элементов массива с номерами кратными 7. 

10) Создать массив из N целых чисел, N вводит пользователь.
Заполнить массив случайным образом в диапазоне от 1 до 12.
Каждое число это оценка по 12 бальной системе.
Пользуясь указателем на массив целых чисел, посчитать процент двоек, троек, четверок и пятерок.
Двойка от 1 до 3 включительно, тройка от 4 до 6, четверка от 7 до 9, пятерка от 10 до 12. 

11) Используя указатели, перенести в хвост одномерного массива первый отрицательный элемент.

12) Используя указатели, подсчитать в одномерном массиве максимальное количество подряд идущих нулей. 

13) Запросить у пользователя размерность для одномерного массива вещественных чисел.
Динамически создать такой массив и заполнить его случайными числами в диапазоне от 0 до 1. 

14) Написать программу, которая содержит функцию, принимающую в качестве аргумента, указатель на массив и размер массива, и заменяет отрицательные элементы на 0. 

------------------------------------------------
1) Исправить код:
#include <iostream>
using namespace std;
void main()
{
 int a=2, b=5;
 int *p1, *p2=&b;
 *p1=10;
 cout<<*p1-*p2;
}

2) Исправить код:
#include <iostream>
using namespace std;
void main()
{
 double a=2.5, b=5.2, res;
 int *p1=a, p2=b;
 res=*p1-p2;
 cout<<res;
}

3) Исправить код: 
#include <iostream>
using namespace std;
#define SIZE 10
void main()
{
 int A[SIZE]={1,2,3,4,5,6,7,8,9,10};
 int *p=A;
 for(int i=0; i<SIZE; i++) //выполнить вывод массива используя указатели
  cout << *A++;
}

4) Для кода:
#include <iostream>
using namespace std;
void main()
{
 int a=2;
 int *p=&a;
 //Объяснить, в чём заключается разница между операциями
 (*p)++;
 //и
 *p++;
} 

