#include <iostream>
using namespace std;

int main() {


	setlocale(LC_ALL, "RUS");

	// 1

	/*int range1, range2, summ = 0 , counter;
	cout << "Введите диапазон: ";
	cin >> range1 >> range2;
	counter = range1;
	while (counter<=range2)
	{
		summ+=counter;
		counter++;
	}
	cout << "Сумма: " << summ;*/

	// 2
	

	//int i = 0;
	//	while (i < 256) {
	//	char b = i;
	//	i++;
	//	cout << i << "   " << b << endl;
	//}

	// 3

	/*float a, b, c, d, e;
	cout << "Введите числа: ";
	cin >> a >> b >> c >> d >> e;
	double average = (a + b + c + d + e) / 5;
	cout << "Сумма чисел: " << a + b + c + d + e << endl;
	cout << "Среднее значение: " << average << endl;*/

	//4 Пользователь вводит число. Посчитать количество цифр этого числа, их сумму и среднее арифметическое
	

	//int chislo, cp, kolcifr = 0, sum = 0, c = 0;

	//cout << "Введите число: ";
	//cin >> chislo;
	//cp = chislo;
	//for (kolcifr = 0; cp > 0; kolcifr++)
	//{
	//	sum += cp % 10;
	//	cp /= 10;
	//}
	//cout << "\nКоличевство цифр = " << kolcifr;
	//cout << " \nСумма цифр = " << sum << "\nСреднее арифметическое = ";
	//cout << (double)sum / kolcifr << "\n";


	//5


}