#include <iostream>
#include <iomanip>  // библиотека манипуляторов для cout
using namespace std;

/*
12. ***Написать программу, которая выводит на экран 
шахматную доску с заданным размером клеточки.
Например, для клетки размером 3:
***---***---***---***---
***---***---***---***---
***---***---***---***---
---***---***---***---***
---***---***---***---***
---***---***---***---***
*/
int main()
{
  setlocale(LC_ALL, "RUS");
  int N, M; // размер шахматной доски: высота, ширина
  int h, w; // размер одной клетки: высота, ширина
  cout << "Введите размер доски: ";
  cin >> N >> M;
  cout << "Введите размер клетки: ";
  cin >> h >> w;
  // по столбцам
  for (int i = 0; i < N; i++) { // по клеткам
    for (int j = 0; j < h; j++) { // по символам внутри клетки
      // по строкам
      for (int k = 0; k < M; k++) { // по клеткам
        for (int g = 0; g < w; g++) { // по символам внутри клетки
          if ((i + k) % 2 == 0) { cout << "#"; }
          else                  { cout << "-"; }
        }
      }
      cout << endl;
    }
  }
  cin.get(); cin.get();
}
