Задачи по теме "Строки"

Рекомендации:
Ввод с клавиатуры с помощью cin не позволяет ввести пробелы, поэтому можно вместо пробелов вводить символ подчеркивания «_»
или воспользоваться cin.getline().
Пример:
 char Mas[250];
 cin.getline(Mas,250); - чтение строки вместе с пробелами
 cout << Mas; 

1. *Написать функцию, которая вычисляет длину строки, проиллюстрировать примером ее работу.

2. *Написать программу, которая заменяет все символы точки «.» в строке, введенной пользователем, на символы восклицательного знака «!».

3. *Написать программу, которая заменяет все символы вопросительного знака «?» в строке, введенной пользователем, на символы «1».

4. *Пользователь вводит строку, посчитать, сколько в ней символов «%».

5. *Пользователь вводит строку символов и искомый символ, посчитать сколько раз он встречается в строке.

6. Подсчитать количество слов во введенном предложении.
a) * между словами находится только 1 пробел
b) **пробелы также могут располагаться вначале и в конце предложения.
c) ***пробелы могут располагаться вначале и в конце предложения, и между словами может быть более 1 пробела.

7.**Пользователь вводит строку и слово. Осуществить в этой строке поиск заданного слова. 

8.**Пользователь вводит строку, строку для поиска и строку для замены.
Программа заменяет все вхождения строки поиска на строку замены. 


9. **Написать группу функций поиска и удаления пробелов:
LTrim() - удаление пробельных символов слева - ведущие пробелы
RTrim() - удаление пробельных символов справа - конечные пробелы
Trim()  - удаление пробельных символов спава и слева
TrimAll() - удаление всех   лишних   пробелов удаление всех лишних пробелов
Прототипы ф-ций:
char * LTrim(char * str);       // Ф-ция удаления ведущих (слева) пробелов в строке
char * RTrim(char * str);       // Ф-ция удаления хвостовых (справа) пробелов в строке
char * Trim(char * str);        // Ф-ция удаления ведущих и хвостовых пробелов в строке
char * TrimAll(char * str);     // Ф-ция удаления всех лишних пробелов в строке
